Revit 2026 API

# BRepBuilder Properties

---

The BRepBuilder type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from ShapeBuilder) |

#### Reference

BRepBuilder Class

Autodesk.Revit.DB Namespace